#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_security_group.AllowEC2Connect: Refreshing state... [id=sg-05b8170cfdd20b11f]
data.aws_security_group.testsg: Reading...
data.aws_security_group.testsg: Read complete after 1s [id=sg-0dfd41989c59bfe6a]
aws_instance.ShiTestInstance: Refreshing state... [id=i-061c441df82169dd7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_instance.ShiTestInstance will be updated in-place
  ~ resource "aws_instance" "ShiTestInstance" {
        id                                   = "i-061c441df82169dd7"
        tags                                 = {
            "Name" = "terraform-git-practice"
        }
      ~ vpc_security_group_ids               = [
          + "allow_ec2_connect",
            # (1 unchanged element hidden)
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_security_group.AllowEC2Connect will be destroyed
  # (because aws_security_group.AllowEC2Connect is not in configuration)
  - resource "aws_security_group" "AllowEC2Connect" {
      - arn                    = "arn:aws:ec2:us-east-1:673304601764:security-group/sg-05b8170cfdd20b11f" -> null
      - description            = "Allow IP range for SSH via EC2 Connect traffic" -> null
      - egress                 = [] -> null
      - id                     = "sg-05b8170cfdd20b11f" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "18.206.107.24/29",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "AllowEC2Connect" -> null
      - owner_id               = "673304601764" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0080973ea5e293644" -> null
    }

  # aws_security_group.allow_ec2_connect will be created
  + resource "aws_security_group" "allow_ec2_connect" {
      + arn                    = (known after apply)
      + description            = "Allow IP range for SSH via EC2 Connect traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "18.206.107.24/29",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_ec2_connect"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  - AllowEC2Connect   = "AllowEC2Connect" -> null
  + allow_ec2_connect = "allow_ec2_connect"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @goodySG, Action: `pull_request`*